package pages.homePage.center;

import org.openqa.selenium.WebDriver;
import pages.base.BasePage;

public class ShopsMapHomePage extends BasePage {
    public ShopsMapHomePage(WebDriver driver) {
        super(driver);
    }

    //  Текст "Магазины в 40 городах России",
    //  Текст "Список магазинов",
    //  редирект по ссылке "Список магазинов",
    //  редирект по стрелке справа от текста "Список магазинов",
    //  перемещение области видимости карты,
    //  отображение карточки магазина при клике на магазин на карте,
    //  открытие новой вкладки со стр магазина после клика на ссылку в карточке магазина
    //  на карточке магазина весь текст (время работы тоже м.б. разным)
    //  закрыть карточку магазина крестиком
    //  соответствие магазинов на карте предустановленному бизнес-региону (не д. меняться)
    //  соответствие магазинов на карте предустановленному способу доставки (не д. меняться)
    //



}
